max-connect.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="warning">
  <clients>
    <client host="tsung0" cpu="1" use_controller_vm="false" maxusers="64000" />
    <client host="tsung1" cpu="1" use_controller_vm="false" maxusers="64000" />
  </clients>

  <servers>
    <server host="tsung-server" port="4000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="minute">
      <users maxnumber="10000" arrivalrate="1000" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/socket/websocket"></websocket>
      </request>

      <request>
        <websocket type="message">{"topic":"rooms:lobby", "event":"phx_join", "payload": {}, "ref":"1"}</websocket>
      </request>

      <for var="i" from="1" to="1000" incr="1">
        <thinktime value="30"/>
      </for>
    </session>
  </sessions>
</tsung>